Repository: jsoeterbroek/pictostick
Catalog: pictodevice/docs/locale/*/LC_MESSAGES/docs.po
Languages: nl

source: Device Settings
nl: Apparaatinstellingen

source: The PictoStick has a hidden on-device menu for caretakers to adjust core settings without needing a computer.
nl: De PictoStick heeft een verborgen menu op het apparaat waarmee zorgverleners de kerninstellingen kunnen aanpassen zonder een computer nodig te hebben.

source: Accessing the Configuration Menu
nl: Toegang tot het Configuratiemenu

source: To open the main configuration menu, press and hold **Button B** (the lower side button) for about 5 seconds while the device is on.
nl: Om het hoofdconfiguratiemenu te openen, houdt u **Knop B** (de onderste zijknop) ongeveer 5 seconden ingedrukt terwijl het apparaat aan is.

source: This will bring up a menu with several options. Use **Button A** and **Button B** to navigate up and down the list, and **Button C** (the large M5 button) to select an option.
nl: Dit opent een menu met verschillende opties. Gebruik **Knop A** en **Knop B** om door de lijst omhoog en omlaag te navigeren, en **Knop C** (de grote M5-knop) om een optie te selecteren.

source: The main configuration menu
nl: Het hoofdconfiguratiemenu

source: Menu Options
nl: Menu-opties

source: WiFi Configuration
nl: WiFi-configuratie

source: This option forces the device back into **WiFi Configuration Mode**. This is useful if you need to change the WiFi network the device is connected to (e.g., you've changed your home router).
nl: Deze optie dwingt het apparaat terug naar de **WiFi-configuratiemodus**. Dit is handig als u het WiFi-netwerk waarmee het apparaat is verbonden, moet wijzigen (bijv. als u uw thuisrouter hebt vervangen).

source: See the :ref:`initial_setup` guide for details on this process.
nl: Zie de :ref:`initial_setup` handleiding voor details over dit proces.

source: Picto Sequence Update
nl: Picto-volgorde bijwerken

source: This is the most common mode you will use. Selecting this puts the device into **Web Administration Mode**, allowing you to manage the user's weekly activity schedule.
nl: Dit is de modus die u het meest zult gebruiken. Als u dit selecteert, wordt het apparaat in de **Webbeheermodus** gezet, zodat u het wekelijkse activiteitenschema van de gebruiker kunt beheren.

source: For a complete guide on this, see :ref:`managing_activities`.
nl: Voor een volledige handleiding hierover, zie :ref:`managing_activities`.

source: Setup
nl: Instellingen

source: This opens a sub-menu for adjusting basic hardware settings.
nl: Dit opent een submenu voor het aanpassen van de basis hardware-instellingen.

source: **Time**: Manually adjust the hours, minutes, and seconds. Note: The time should sync automatically if WiFi is configured, so this is for offline adjustments.
nl: **Tijd**: Pas handmatig de uren, minuten en seconden aan. Let op: de tijd zou automatisch moeten synchroniseren als WiFi is geconfigureerd, dus dit is voor offline aanpassingen.

source: **Brightness**: Change the screen brightness level.
nl: **Helderheid**: Wijzig het helderheidsniveau van het scherm.

source: **Buzzer**: Turn the internal buzzer on or off for audible alerts.
nl: **Zoemer**: Schakel de interne zoemer in of uit voor hoorbare waarschuwingen.

source: **Theme**: Cycle through different pre-set color themes for the display.
nl: **Thema**: Blader door verschillende vooraf ingestelde kleurenthema's voor het display.

source: Use Button A and B to highlight a setting, and Button C to select and change it.
nl: Gebruik Knop A en B om een instelling te markeren, en Knop C om deze te selecteren en te wijzigen.

source: Normal Mode
nl: Normale Modus

source: Select this option to exit the configuration menu and return the device to its normal, everyday operating mode.
nl: Selecteer deze optie om het configuratiemenu te verlaten en het apparaat terug te zetten naar de normale, dagelijkse bedrijfsmodus.

source: Initial Setup
nl: Eerste Installatie

source: This guide is for the one-time setup of a new PictoStick device.
nl: Deze handleiding is voor de eenmalige installatie van een nieuw PictoStick-apparaat.

source: The first time the PictoStick is powered on, it must be connected to a local WiFi network. This allows it to sync the correct time and date from the internet, which is essential for displaying the correct daily schedules.
nl: De eerste keer dat de PictoStick wordt ingeschakeld, moet deze worden verbonden met een lokaal WiFi-netwerk. Hierdoor kan het de juiste tijd en datum synchroniseren via internet, wat essentieel is voor het weergeven van de juiste dagschema's.

source: This process uses a feature called **WiFiManager**. It creates a temporary WiFi access point that you can connect to with a phone or computer to enter your network credentials.
nl: Dit proces maakt gebruik van een functie genaamd **WiFiManager**. Het creëert een tijdelijk WiFi-toegangspunt waarmee u verbinding kunt maken met een telefoon of computer om uw netwerkgegevens in te voeren.

source: Step-by-Step Guide
nl: Stapsgewijze Handleiding

source: **Power on the PictoStick.** Press and hold the side power button (Button A) for about 6 seconds. The device will boot up and, since it has no saved WiFi credentials, it will automatically enter WiFi configuration mode. The screen will display a message indicating it has started a WiFi Access Point.
nl: **Schakel de PictoStick in.** Houd de aan/uit-knop aan de zijkant (Knop A) ongeveer 6 seconden ingedrukt. Het apparaat start op en, omdat er geen WiFi-gegevens zijn opgeslagen, gaat het automatisch naar de WiFi-configuratiemodus. Het scherm toont een bericht dat aangeeft dat er een WiFi-toegangspunt is gestart.

source: PictoStick in WiFi configuration mode
nl: PictoStick in WiFi-configuratiemodus

source: **Connect to the "pictodevice" Network.** On a smartphone, tablet, or computer, open your WiFi settings and look for a new network named **pictodevice**. Connect to it.
nl: **Maak verbinding met het "pictodevice"-netwerk.** Open op een smartphone, tablet of computer uw WiFi-instellingen en zoek naar een nieuw netwerk met de naam **pictodevice**. Maak er verbinding mee.

source: **Open the Configuration Portal.** Once connected, a captive portal page should open automatically in your web browser. If it doesn't, open a browser and navigate to ``http://192.168.4.1``.
nl: **Open de Configuratieportal.** Eenmaal verbonden, zou er automatisch een captive portal-pagina moeten openen in uw webbrowser. Als dit niet gebeurt, opent u een browser en navigeert u naar ``http://192.168.4.1``.

source: **Configure WiFi.** In the portal, you will see a few options. * Click on **"Configure WiFi"**. * A list of nearby WiFi networks will be displayed. Select your local network (e.g., "MyHomeWiFi"). * Enter the password for your WiFi network in the password field. * Select the correct **Timezone** from the dropdown list. This is crucial for ensuring the time is correct for your location. * Click **"Save"**.
nl: **Configureer WiFi.** In de portal ziet u een paar opties. * Klik op **"Configureer WiFi"**. * Er wordt een lijst met nabijgelegen WiFi-netwerken weergegeven. Selecteer uw lokale netwerk (bijv. "MijnThuisWiFi"). * Voer het wachtwoord voor uw WiFi-netwerk in het wachtwoordveld in. * Selecteer de juiste **Tijdzone** in de vervolgkeuzelijst. Dit is cruciaal om ervoor te zorgen dat de tijd correct is voor uw locatie. * Klik op **"Opslaan"**.

source: WiFiManager configuration screen
nl: WiFiManager configuratiescherm

source: **Setup Complete.** The PictoStick will now save your credentials, disconnect the temporary access point, and connect to your selected WiFi network. It will sync the time, and then reboot into its normal operating mode.
nl: **Installatie voltooid.** De PictoStick slaat nu uw gegevens op, verbreekt de verbinding met het tijdelijke toegangspunt en maakt verbinding met het door u geselecteerde WiFi-netwerk. Het synchroniseert de tijd en start vervolgens opnieuw op in de normale bedrijfsmodus.

source: The device will not use WiFi during normal operation to conserve battery. It will only briefly reconnect when it needs to sync the time or when you enter the web administration mode to manage activities.
nl: Het apparaat gebruikt geen WiFi tijdens normaal gebruik om de batterij te sparen. Het maakt alleen kort opnieuw verbinding wanneer het de tijd moet synchroniseren of wanneer u de webbeheermodus opent om activiteiten te beheren.

source: Managing Activities
nl: Activiteiten Beheren

source: The core of the PictoStick's configuration is managing the user's weekly activity schedule. This is done through a simple web interface that you can access from a computer, tablet, or smartphone.
nl: De kern van de configuratie van de PictoStick is het beheren van het wekelijkse activiteitenschema van de gebruiker. Dit gebeurt via een eenvoudige webinterface die u kunt openen vanaf een computer, tablet of smartphone.

source: Before you begin, ensure the PictoStick has been configured to connect to your local WiFi network as described in the :ref:`initial_setup` guide.
nl: Voordat u begint, moet u ervoor zorgen dat de PictoStick is geconfigureerd om verbinding te maken met uw lokale WiFi-netwerk, zoals beschreven in de :ref:`initial_setup` handleiding.

source: Entering Web Administration Mode
nl: Webbeheermodus openen

source: On the PictoStick, press and hold **Button B** for 5 seconds to open the configuration menu.
nl: Houd op de PictoStick **Knop B** 5 seconden ingedrukt om het configuratiemenu te openen.

source: Use the side buttons to navigate to **"Picto Sequence Update"** and press **Button C** to select it.
nl: Gebruik de zijknoppen om naar **"Picto-volgorde bijwerken"** te navigeren en druk op **Knop C** om dit te selecteren.

source: The device will connect to WiFi and start a web server. The screen will display the IP address you need to connect to (e.g., ``http://192.168.1.123``).
nl: Het apparaat maakt verbinding met WiFi en start een webserver. Het scherm toont het IP-adres waarmee u verbinding moet maken (bijv. ``http://192.168.1.123``).

source: The PictoStick screen showing the web server IP address.
nl: Het PictoStick-scherm toont het IP-adres van de webserver.

source: On a device connected to the **same WiFi network**, open a web browser and type in the IP address shown on the PictoStick screen.
nl: Open op een apparaat dat met **hetzelfde WiFi-netwerk** is verbonden een webbrowser en typ het IP-adres in dat op het PictoStick-scherm wordt weergegeven.

source: The Web Interface
nl: De Webinterface

source: The web interface allows you to set a unique schedule for every day of the week.
nl: Met de webinterface kunt u voor elke dag van de week een uniek schema instellen.

source: The web interface for managing activities.
nl: De webinterface voor het beheren van activiteiten.

source: **User Name**: At the top, you can set the name of the user, which will be displayed on the PictoStick's main screen.
nl: **Gebruikersnaam**: Bovenaan kunt u de naam van de gebruiker instellen, die op het hoofdscherm van de PictoStick wordt weergegeven.

source: **Day Tabs**: Click on the tabs for **Monday, Tuesday, Wednesday, etc.**, to switch between the schedules for each day.
nl: **Dag-tabbladen**: Klik op de tabbladen voor **Maandag, Dinsdag, Woensdag, etc.**, om te schakelen tussen de schema's voor elke dag.

source: **Activity Schedule (Top Section)**: This area shows the current sequence of activities for the selected day. * **To reorder activities**: Click and drag an activity to a new position in the list. * **To remove an activity**: Click the red 'delete' icon next to an activity.
nl: **Activiteitenschema (Bovenste gedeelte)**: Dit gebied toont de huidige volgorde van activiteiten voor de geselecteerde dag. * **Om activiteiten opnieuw te ordenen**: Klik en sleep een activiteit naar een nieuwe positie in de lijst. * **Om een activiteit te verwijderen**: Klik op het rode 'verwijder'-pictogram naast een activiteit.

source: **Available Pictos (Bottom Section)**: This is your library of all available pictos on the device. * **To add an activity to the schedule**: Find the picto you want in the library and click the green 'add' icon. It will be added to the end of the schedule for the currently selected day.
nl: **Beschikbare Picto's (Onderste gedeelte)**: Dit is uw bibliotheek met alle beschikbare picto's op het apparaat. * **Om een activiteit aan het schema toe te voegen**: Zoek de gewenste picto in de bibliotheek en klik op het groene 'voeg toe'-pictogram. Het wordt toegevoegd aan het einde van het schema voor de momenteel geselecteerde dag.

source: **Saving Changes**: After you have arranged the schedules for all the days, click the blue **"Save Configuration"** button at the bottom.
nl: **Wijzigingen opslaan**: Nadat u de schema's voor alle dagen hebt ingedeeld, klikt u op de blauwe knop **"Configuratie opslaan"** onderaan.

source: The PictoStick will save the new schedules and automatically reboot into its normal mode, ready for the user.
nl: De PictoStick slaat de nieuwe schema's op en start automatisch opnieuw op in de normale modus, klaar voor de gebruiker.

source: Each day can have a maximum of 20 activities. The available pictos are stored on the device itself. For information on adding new custom pictos, see the :ref:`setup` guide.
nl: Elke dag kan maximaal 20 activiteiten hebben. De beschikbare picto's worden op het apparaat zelf opgeslagen. Voor informatie over het toevoegen van nieuwe aangepaste picto's, zie de :ref:`setup` handleiding.

source: Codebase Architecture
nl: Architectuur van de Codebase

source: This document provides a high-level overview of the PictoStick source code structure.
nl: Dit document geeft een overzicht op hoog niveau van de structuur van de PictoStick-broncode.

source: Directory Structure
nl: Mappenstructuur

source: ``src/``: Contains all the C++ source code for the firmware. * ``main.cpp``: The main entry point of the application. Handles initialization and the main loop. * ``ui*.cpp``: Source files related to the user interface, built with the LVGL library. * ``system.cpp``: Manages system-level functions like time, battery, and WiFi. * ``fs_helpers.cpp``: Helper functions for interacting with the SPIFFS filesystem. * ``PSpref.cpp``: Manages persistent storage of settings in NVS (Non-Volatile Storage).
nl: ``src/``: Bevat alle C++ broncode voor de firmware. * ``main.cpp``: Het hoofdingangspunt van de applicatie. Verwerkt initialisatie en de hoofdloop. * ``ui*.cpp``: Bronbestanden gerelateerd aan de gebruikersinterface, gebouwd met de LVGL-bibliotheek. * ``system.cpp``: Beheert systeembrede functies zoals tijd, batterij en WiFi. * ``fs_helpers.cpp``: Hulpfuncties voor interactie met het SPIFFS-bestandssysteem. * ``PSpref.cpp``: Beheert persistente opslag van instellingen in NVS (Non-Volatile Storage).

source: ``include/``: Contains all the header files (`.h`) corresponding to the source files in `src/`.
nl: ``include/``: Bevat alle headerbestanden (`.h`) die overeenkomen met de bronbestanden in `src/`.

source: ``data/``: Contains all files that will be uploaded to the device's filesystem (SPIFFS). * ``picto/``: The library of all available PNG picto images. * ``index.html``, ``style.css``: The web interface for managing activities. * ``data_*.json``: The JSON files where the weekly activity schedules are stored.
nl: ``data/``: Bevat alle bestanden die naar het bestandssysteem van het apparaat (SPIFFS) worden geüpload. * ``picto/``: De bibliotheek met alle beschikbare PNG-picto-afbeeldingen. * ``index.html``, ``style.css``: De webinterface voor het beheren van activiteiten. * ``data_*.json``: De JSON-bestanden waarin de wekelijkse activiteitenschema's worden opgeslagen.

source: ``lib/``: This directory is managed by PlatformIO and contains all the external libraries the project depends on.
nl: ``lib/``: Deze map wordt beheerd door PlatformIO en bevat alle externe bibliotheken waarvan het project afhankelijk is.

source: ``platformio.ini``: The main configuration file for PlatformIO. It defines the board, framework, libraries, and build flags.
nl: ``platformio.ini``: Het hoofdconfiguratiebestand voor PlatformIO. Het definieert het bord, het framework, de bibliotheken en de build-vlaggen.

source: Core Components
nl: Kerncomponenten

source: Main Loop
nl: Hoofdloop

source: The ``main.cpp`` file contains the ``setup()`` and ``loop()`` functions, which are standard in the Arduino framework.
nl: Het ``main.cpp``-bestand bevat de ``setup()``- en ``loop()``-functies, die standaard zijn in het Arduino-framework.

source: ``setup()``: Initializes hardware (display, buttons), filesystems, WiFi, and the user interface. It determines which mode the device should boot into (Normal, WiFi Config, Web Admin).
nl: ``setup()``: Initialiseert hardware (display, knoppen), bestandssystemen, WiFi en de gebruikersinterface. Het bepaalt in welke modus het apparaat moet opstarten (Normaal, WiFi Config, Web Admin).

source: ``loop()``: The main application loop. It primarily calls the LVGL task handler (``lv_timer_handler()``) which manages all UI rendering and interaction. It also handles button presses and power management.
nl: ``loop()``: De hoofdlus van de applicatie. Het roept voornamelijk de LVGL-taakhandler aan (``lv_timer_handler()``) die alle UI-rendering en -interactie beheert. Het verwerkt ook knopdrukken en energiebeheer.

source: User Interface (LVGL)
nl: Gebruikersinterface (LVGL)

source: The user interface is built using the **LVGL (Light and Versatile Graphics Library)**.
nl: De gebruikersinterface is gebouwd met de **LVGL (Light and Versatile Graphics Library)**.

source: ``uimain.cpp`` is responsible for creating and managing the main screen, including the picto display, labels, and progress dots.
nl: ``uimain.cpp`` is verantwoordelijk voor het maken en beheren van het hoofdscherm, inclusief de picto-weergave, labels en voortgangsbolletjes.

source: ``uisetup.cpp`` handles the on-device setup menu.
nl: ``uisetup.cpp`` verwerkt het setup-menu op het apparaat.

source: ``uiconfig.cpp`` manages the WiFi and Web Admin mode screens.
nl: ``uiconfig.cpp`` beheert de schermen voor de WiFi- en Web Admin-modus.

source: Data Flow
nl: Gegevensstroom

source: The activity schedules are stored as JSON files in the ``data/`` directory.
nl: De activiteitenschema's worden opgeslagen als JSON-bestanden in de ``data/``-map.

source: When in Web Administration mode, the web server (ESPAsyncWebServer) serves the ``index.html`` and ``style.css`` files.
nl: In de webbeheermodus levert de webserver (ESPAsyncWebServer) de bestanden ``index.html`` en ``style.css``.

source: The web interface fetches the ``data_*.json`` files to display the current schedules.
nl: De webinterface haalt de ``data_*.json``-bestanden op om de huidige schema's weer te geven.

source: When the caretaker saves the configuration, the web interface sends the new schedule data back to the device, which overwrites the corresponding ``data_*.json`` files on the filesystem.
nl: Wanneer de zorgverlener de configuratie opslaat, stuurt de webinterface de nieuwe schemagegevens terug naar het apparaat, dat de overeenkomstige ``data_*.json``-bestanden op het bestandssysteem overschrijft.

source: In normal mode, the device reads the appropriate ``data_*.json`` file for the current day to load and display the activities.
nl: In de normale modus leest het apparaat het juiste ``data_*.json``-bestand voor de huidige dag om de activiteiten te laden en weer te geven.

source: Power Management
nl: Energiebeheer

source: To conserve battery, the device makes use of several strategies:
nl: Om de batterij te sparen, maakt het apparaat gebruik van verschillende strategieën:

source: **Light Sleep**: The ESP32 enters a light sleep mode when the screen is off.
nl: **Lichte slaapstand**: De ESP32 gaat in een lichte slaapstand wanneer het scherm uit is.

source: **WiFi Off**: WiFi is only enabled when actively needed (initial time sync, web admin mode) and is turned off otherwise.
nl: **WiFi uit**: WiFi wordt alleen ingeschakeld wanneer het actief nodig is (initiële tijdsynchronisatie, webbeheermodus) en wordt anders uitgeschakeld.

source: **Screen Timeout**: The screen backlight is turned off after a short period of inactivity.
nl: **Scherm-time-out**: De achtergrondverlichting van het scherm wordt uitgeschakeld na een korte periode van inactiviteit.

source: Building and Uploading
nl: Bouwen en Uploaden

source: Once your :ref:`setup` is complete, you can compile the firmware and upload it to the PictoStick device.
nl: Zodra uw :ref:`setup` is voltooid, kunt u de firmware compileren en uploaden naar het PictoStick-apparaat.

source: You can perform these actions using the PlatformIO toolbar in the VS Code status bar (at the bottom of the window) or by running the commands in the VS Code terminal.
nl: U kunt deze acties uitvoeren met de PlatformIO-werkbalk in de VS Code-statusbalk (onderaan het venster) of door de opdrachten in de VS Code-terminal uit te voeren.

source: Using the VS Code Terminal
nl: De VS Code Terminal gebruiken

source: The project is configured to use a local Python virtual environment (`penv`) for the PlatformIO CLI to ensure version consistency.
nl: Het project is geconfigureerd om een lokale Python virtuele omgeving (`penv`) te gebruiken voor de PlatformIO CLI om versieconsistentie te garanderen.

source: **On Linux/macOS**: ``penv/bin/pio``
nl: **Op Linux/macOS**: ``penv/bin/pio``

source: **On Windows**: ``penv\Scripts\pio``
nl: **Op Windows**: ``penv\Scripts\pio``

source: All commands below will use the Linux/macOS syntax.
nl: Alle onderstaande commando's gebruiken de Linux/macOS-syntaxis.

source: Compiling the Firmware
nl: De Firmware Compileren

source: To build the project and compile the firmware, run the following command:
nl: Voer de volgende opdracht uit om het project te bouwen en de firmware te compileren:

source: This command compiles all source code and links the firmware. If successful, it will create a ``firmware.bin`` file in the project's ``.pio/build/<environment>/`` directory.
nl: Dit commando compileert alle broncode en linkt de firmware. Als dit lukt, wordt er een ``firmware.bin``-bestand gemaakt in de ``.pio/build/<environment>/``-map van het project.

source: Uploading the Firmware
nl: De Firmware Uploaden

source: To compile the firmware and upload it to a connected PictoStick device:
nl: Om de firmware te compileren en te uploaden naar een aangesloten PictoStick-apparaat:

source: Connect the PictoStick to your computer using the USB-C cable.
nl: Sluit de PictoStick aan op uw computer met de USB-C-kabel.

source: Run the following command:
nl: Voer het volgende commando uit:

source: PlatformIO will automatically detect the port the device is connected to and flash the new firmware.
nl: PlatformIO detecteert automatisch de poort waarop het apparaat is aangesloten en flasht de nieuwe firmware.

source: Uploading the Filesystem Image
nl: De Bestandssysteem-image Uploaden

source: The PictoStick stores assets like pictos, web interface files (HTML, CSS), and configuration files in a separate SPIFFS (SPI Flash File System) partition on the device.
nl: De PictoStick slaat middelen zoals picto's, webinterfacebestanden (HTML, CSS) en configuratiebestanden op in een afzonderlijke SPIFFS (SPI Flash File System)-partitie op het apparaat.

source: The contents of this filesystem are located in the ``data/`` directory of the project.
nl: De inhoud van dit bestandssysteem bevindt zich in de ``data/``-map van het project.

source: If you make any changes to the files in the ``data/`` directory (e.g., adding a new picto), you must rebuild and upload the filesystem image.
nl: Als u wijzigingen aanbrengt in de bestanden in de ``data/``-map (bijv. een nieuwe picto toevoegen), moet u de bestandssysteem-image opnieuw bouwen en uploaden.
