Repository: jsoeterbroek/pictostick
Catalog: pictodevice/docs/locale/*/LC_MESSAGES/docs.po
Languages: nl

source: This will create a new filesystem image from the contents of the ``data/`` directory and flash it to the device.
nl: Dit maakt een nieuwe bestandssysteem-image van de inhoud van de ``data/``-map en flasht deze naar het apparaat.

source: All-in-One Command
nl: Alles-in-één Commando

source: To clean the build, compile the firmware, and upload both the firmware and the filesystem in one go, you can run:
nl: Om de build op te schonen, de firmware te compileren en zowel de firmware als het bestandssysteem in één keer te uploaden, kunt u het volgende uitvoeren:

source: This is often the most convenient command to use when you want to deploy a full update to the device.
nl: Dit is vaak het handigste commando om te gebruiken wanneer u een volledige update op het apparaat wilt implementeren.

source: Contributing
nl: Bijdragen

source: We welcome contributions to the PictoStick project! This document outlines the standards and procedures for contributing.
nl: We verwelkomen bijdragen aan het PictoStick-project! Dit document schetst de normen en procedures voor het leveren van bijdragen.

source: Coding Style
nl: Codeerstijl

source: The project uses a consistent C++ coding style enforced by **ClangFormat**. The configuration for this is defined in the ``.clang-format`` file in the root of the repository.
nl: Het project gebruikt een consistente C++-codeerstijl die wordt afgedwongen door **ClangFormat**. De configuratie hiervoor is gedefinieerd in het ``.clang-format``-bestand in de hoofdmap van de repository.

source: Before submitting any code changes, please ensure you have formatted your code by running ClangFormat. Many IDEs, including VS Code, have extensions that can do this automatically on save.
nl: Voordat u codewijzigingen indient, moet u ervoor zorgen dat u uw code hebt geformatteerd door ClangFormat uit te voeren. Veel IDE's, waaronder VS Code, hebben extensies die dit automatisch kunnen doen bij het opslaan.

source: Adding New Pictos
nl: Nieuwe Picto's Toevoegen

source: Adding a new picto to the library is a straightforward process:
nl: Het toevoegen van een nieuwe picto aan de bibliotheek is een eenvoudig proces:

source: **Prepare the Image**: * The image must be in **PNG** format. * It should have a transparent background. * The recommended size is **100x100 pixels**. * The filename should be lowercase, descriptive, and use underscores instead of spaces (e.g., ``swimming_pool.png``).
nl: **Afbeelding voorbereiden**: * De afbeelding moet in **PNG**-formaat zijn. * Het moet een transparante achtergrond hebben. * De aanbevolen grootte is **100x100 pixels**. * De bestandsnaam moet in kleine letters zijn, beschrijvend en underscores gebruiken in plaats van spaties (bijv. ``zwembad.png``).

source: **Add to Filesystem**: * Place the new PNG file into the ``data/picto/`` directory.
nl: **Toevoegen aan bestandssysteem**: * Plaats het nieuwe PNG-bestand in de ``data/picto/``-map.

source: **Update Filesystem Image**: * You must now :ref:`rebuild and upload the filesystem <building>` to the device for the new picto to be available in the web interface. Run the following PlatformIO command:
nl: **Bestandssysteem-image bijwerken**: * U moet nu :ref:`het bestandssysteem opnieuw bouwen en uploaden <building>` naar het apparaat zodat de nieuwe picto beschikbaar is in de webinterface. Voer het volgende PlatformIO-commando uit:

source: The new picto will now appear in the "Available Pictos" library in the web administration interface.
nl: De nieuwe picto verschijnt nu in de "Beschikbare Picto's"-bibliotheek in de webbeheerinterface.

source: Submitting Changes
nl: Wijzigingen Indienen

source: All changes should be submitted via **Pull Requests** to the `main` branch of the GitHub repository.
nl: Alle wijzigingen moeten worden ingediend via **Pull Requests** naar de `main`-branch van de GitHub-repository.

source: **Fork the repository** on GitHub.
nl: **Fork de repository** op GitHub.

source: **Create a new branch** for your feature or bug fix.
nl: **Maak een nieuwe branch** voor uw functie of bugfix.

source: **Commit your changes** to your branch.
nl: **Commit uw wijzigingen** naar uw branch.

source: **Push your branch** to your fork.
nl: **Push uw branch** naar uw fork.

source: **Open a Pull Request** from your branch to the `main` branch of the original repository.
nl: **Open een Pull Request** van uw branch naar de `main`-branch van de oorspronkelijke repository.

source: Please provide a clear description of the changes you have made in the Pull Request.
nl: Geef een duidelijke beschrijving van de wijzigingen die u hebt aangebracht in de Pull Request.

source: Developer Setup
nl: Ontwikkelaarsinstellingen

source: **Intended Audience**: This document is for developers who want to modify, build, and flash the PictoStick firmware.
nl: **Doelgroep**: Dit document is voor ontwikkelaars die de PictoStick-firmware willen wijzigen, bouwen en flashen.

source: The PictoStick project is built using PlatformIO, a professional ecosystem for embedded development.
nl: Het PictoStick-project is gebouwd met PlatformIO, een professioneel ecosysteem voor embedded ontwikkeling.

source: The primary source code repository is hosted on GitHub:
nl: De primaire broncode-repository wordt gehost op GitHub:

source: Prerequisites
nl: Vereisten

source: You will need the following tools installed on your development machine:
nl: U moet de volgende tools op uw ontwikkelmachine hebben geïnstalleerd:

source: **Visual Studio Code**: The recommended IDE for this project. * Download at: https://code.visualstudio.com/
nl: **Visual Studio Code**: De aanbevolen IDE voor dit project. * Download op: https://code.visualstudio.com/

source: **PlatformIO IDE Extension**: The extension for VS Code that provides the PlatformIO toolchain. * Install from the Visual Studio Code Marketplace: https://marketplace.visualstudio.com/items?itemName=platformio.platformio-ide
nl: **PlatformIO IDE-extensie**: De extensie voor VS Code die de PlatformIO-toolchain biedt. * Installeer vanuit de Visual Studio Code Marketplace: https://marketplace.visualstudio.com/items?itemName=platformio.platformio-ide

source: **Git**: For cloning the repository and managing source control. * Download at: https://git-scm.com/
nl: **Git**: Voor het klonen van de repository en het beheren van broncodebeheer. * Download op: https://git-scm.com/

source: Cloning the Repository
nl: De Repository Klonen

source: First, clone the repository from GitHub to your local machine. Open a terminal and run:
nl: Kloon eerst de repository van GitHub naar uw lokale machine. Open een terminal en voer het volgende uit:

source: Project Initialization
nl: Project Initialisatie

source: The project includes a Python virtual environment (`penv`) which contains the specific version of the PlatformIO command-line tool used for this project. While using the VS Code extension is recommended for most tasks, you can also perform all actions from the command line.
nl: Het project bevat een Python virtuele omgeving (`penv`) die de specifieke versie van de PlatformIO-opdrachtregeltool bevat die voor dit project wordt gebruikt. Hoewel het gebruik van de VS Code-extensie voor de meeste taken wordt aanbevolen, kunt u ook alle acties vanaf de opdrachtregel uitvoeren.

source: No special initialization is required. When you open the `pictodevice` folder in VS Code with the PlatformIO extension installed, it should automatically recognize it as a PlatformIO project. It will then download the required toolchains and library dependencies as defined in the ``platformio.ini`` file.
nl: Er is geen speciale initialisatie vereist. Wanneer u de `pictodevice`-map opent in VS Code met de PlatformIO-extensie geïnstalleerd, zou deze deze automatisch moeten herkennen als een PlatformIO-project. Het downloadt dan de vereiste toolchains en bibliotheekafhankelijkheden zoals gedefinieerd in het ``platformio.ini``-bestand.

source: This includes: * The ESP32 board support package. * All necessary libraries, such as WiFiManager, LVGL, and others.
nl: Dit omvat: * Het ESP32 board support package. * Alle benodigde bibliotheken, zoals WiFiManager, LVGL en andere.

source: You are now ready to move on to :ref:`building` the firmware.
nl: U bent nu klaar om verder te gaan met het :ref:`building` van de firmware.

source: 'Caretakers'
nl: 'Zorgverleners'

source: 'Developers'
nl: 'Ontwikkelaars'

source: PictoStick documentation
nl: PictoStick documentatie

source: Introduction
nl: Introductie

source: Users
nl: Gebruikers

source: Caretakers
nl: Zorgverleners

source: Developers
nl: Ontwikkelaars

source: Getting Started
nl: Aan de slag

source: This guide will help you get your PictoStick up and running for the first time.
nl: Deze handleiding helpt u om uw PictoStick voor de eerste keer in gebruik te nemen.

source: What's in the Box
nl: Inhoud van de doos

source: When you acquire the PictoStick, you should have the following items:
nl: Wanneer u de PictoStick aanschaft, zou u de volgende items moeten hebben:

source: The **M5Stack StickC Plus2** device, which is the core of the PictoStick.
nl: Het **M5Stack StickC Plus2**-apparaat, de kern van de PictoStick.

source: A **USB-C cable** for charging and programming the device.
nl: Een **USB-C-kabel** voor het opladen en programmeren van het apparaat.

source: An optional **wristband**, allowing the device to be worn like a watch.
nl: Een optionele **polsband**, waarmee het apparaat als een horloge kan worden gedragen.

source: The PictoStick hardware
nl: De PictoStick-hardware

source: First-Time Use
nl: Eerste Gebruik

source: The first time you turn on the PictoStick, it will need to be configured to connect to your local WiFi network. This is a one-time setup process that allows the device to synchronize the correct time and date, which is crucial for displaying the daily schedules correctly.
nl: De eerste keer dat u de PictoStick inschakelt, moet deze worden geconfigureerd om verbinding te maken met uw lokale WiFi-netwerk. Dit is een eenmalig installatieproces waarmee het apparaat de juiste tijd en datum kan synchroniseren, wat cruciaal is voor het correct weergeven van de dagschema's.

source: **Power On**: Press and hold the side power button (Button A) for about 6 seconds to turn the device on.
nl: **Inschakelen**: Houd de aan/uit-knop aan de zijkant (Knop A) ongeveer 6 seconden ingedrukt om het apparaat in te schakelen.

source: **Enter WiFi Setup**: The device should automatically start in WiFi Configuration mode. If it doesn't, a caretaker can manually enter this mode.
nl: **WiFi-installatie openen**: Het apparaat zou automatisch moeten opstarten in de WiFi-configuratiemodus. Als dit niet gebeurt, kan een zorgverlener deze modus handmatig openen.

source: **Connect from Phone/Computer**: Follow the on-screen instructions to connect your phone or computer to the "pictodevice" WiFi network.
nl: **Verbinden vanaf telefoon/computer**: Volg de instructies op het scherm om uw telefoon of computer te verbinden met het "pictodevice" WiFi-netwerk.

source: **Configure**: Once connected, a configuration portal will appear in your web browser. Select your home WiFi network (SSID) and enter its password.
nl: **Configureren**: Eenmaal verbonden, verschijnt er een configuratieportal in uw webbrowser. Selecteer uw thuis-WiFi-netwerk (SSID) en voer het wachtwoord in.

source: For a detailed walkthrough of this process, please see the :ref:`initial_setup` manual.
nl: Voor een gedetailleerde uitleg van dit proces, zie de :ref:`initial_setup` handleiding.

source: Charging the Device
nl: Het Apparaat Opladen

source: The PictoStick is powered by an internal rechargeable battery.
nl: De PictoStick wordt gevoed door een interne oplaadbare batterij.

source: **To charge the device**, connect the provided USB-C cable to the port at the bottom of the device and plug the other end into a standard USB power adapter or a computer.
nl: **Om het apparaat op te laden**, sluit u de meegeleverde USB-C-kabel aan op de poort aan de onderkant van het apparaat en steekt u het andere uiteinde in een standaard USB-lichtnetadapter of een computer.

source: A **battery indicator** is visible in the top-right corner of the screen during normal operation, showing the current charge level.
nl: Een **batterij-indicator** is zichtbaar in de rechterbovenhoek van het scherm tijdens normaal gebruik en toont het huidige oplaadniveau.

source: A full charge will typically take 1-2 hours. To conserve power, the device screen will automatically turn off after a short period of inactivity. Press Button A to wake it up.
nl: Een volledige lading duurt doorgaans 1-2 uur. Om stroom te besparen, wordt het scherm van het apparaat automatisch uitgeschakeld na een korte periode van inactiviteit. Druk op Knop A om het weer te activeren.

source: Care givers, parents and health care professionals of people with a mental disability and/or an Autism spectrum disorder (ASD), or previously referred to as 'autism', often make use of visual pictograms to give people a clearer understanding of the world around them.
nl: Zorgverleners, ouders en gezondheidsprofessionals van mensen met een verstandelijke beperking en/of een autismespectrumstoornis (ASS), of voorheen 'autisme' genoemd, maken vaak gebruik van visuele pictogrammen om mensen een duidelijker begrip van de wereld om hen heen te geven.

source: One of the biggest advantages of using pictograms (or pictos) is that in one easy to grasp visual form the activities and their sequence that are planned for the day ahead are presented. This provides understanding and prevents stress and miscommunication.
nl: Een van de grootste voordelen van het gebruik van pictogrammen (of picto's) is dat in één gemakkelijk te begrijpen visuele vorm de activiteiten en hun volgorde die voor de komende dag gepland zijn, worden gepresenteerd. Dit zorgt voor begrip en voorkomt stress en miscommunicatie.

source: Often the pictos are presented on a board on the wall or simply on a wooden plank on which the pictos are added (or even removed during the day) showing the activities and the order in which these take place. While this low tech way often works fine in practice it is not portable and often only used in either the users' household or the (work) places during the day.
nl: Vaak worden de picto's gepresenteerd op een bord aan de muur of gewoon op een houten plank waarop de picto's worden toegevoegd (of zelfs gedurende de dag worden verwijderd) om de activiteiten en de volgorde waarin deze plaatsvinden weer te geven. Hoewel deze low-tech manier in de praktijk vaak prima werkt, is deze niet draagbaar en wordt deze vaak alleen gebruikt in het huishouden van de gebruiker of op de (werk)plekken gedurende de dag.

source: The pictostick offers a method to present a scrollable sequence of pictos for the user in a portable way, either as a small device that can be carried around or a watch-like option with a wrist band. The pictostick can be referred to by the user as to the daily activities and even to check off the ones that have already been completed.
nl: De pictostick biedt een methode om een scrollbare reeks picto's voor de gebruiker op een draagbare manier te presenteren, hetzij als een klein apparaat dat kan worden meegenomen, hetzij als een horloge-achtige optie met een polsband. De pictostick kan door de gebruiker worden geraadpleegd voor de dagelijkse activiteiten en zelfs om de reeds voltooide activiteiten af te vinken.

source: Key features
nl: Belangrijkste kenmerken

source: **Portable & Wearable**: Small enough to be carried or worn on a wristband.
nl: **Draagbaar & Wearable**: Klein genoeg om te worden meegenomen of aan een polsband te worden gedragen.

source: **Weekly Schedule**: Displays a unique sequence of activities for each day of the week.
nl: **Wekelijks Schema**: Toont een unieke reeks activiteiten voor elke dag van de week.

source: **Interactive Checklist**: Users can mark activities as "done", providing a sense of accomplishment.
nl: **Interactieve Checklist**: Gebruikers kunnen activiteiten als "klaar" markeren, wat een gevoel van voldoening geeft.

source: **Easy Web Configuration**: Caretakers can easily update the weekly schedule via a simple web interface on a phone or computer.
nl: **Eenvoudige Webconfiguratie**: Zorgverleners kunnen het wekelijkse schema eenvoudig bijwerken via een simpele webinterface op een telefoon of computer.

source: **Customizable Themes**: Supports different color themes to suit user preferences.
nl: **Aanpasbare Thema's**: Ondersteunt verschillende kleurenthema's om aan de voorkeuren van de gebruiker te voldoen.

source: **Power Efficient**: Disables WiFi and sleeps automatically to maximize battery life.
nl: **Energiezuinig**: Schakelt WiFi uit en gaat automatisch in de slaapstand om de levensduur van de batterij te maximaliseren.

source: **Open Source**: The software is fully open source, allowing for community contributions and customization.
nl: **Open Source**: De software is volledig open source, wat bijdragen en aanpassingen door de gemeenschap mogelijk maakt.

source: Requirements
nl: Vereisten

source: M5 StickC Plus2, a low-cost, small form factor ESP32 Mini IoT Development Kit. It has a 1.14-inch TFT screen with a resolution of 135x240 pixels and a battery capacity of 200mAh. (https://shop.m5stack.com/products/m5stickc-plus2-esp32-mini-iot-development-kit)
nl: M5 StickC Plus2, een goedkope, kleine ESP32 Mini IoT Development Kit. Het heeft een 1,14-inch TFT-scherm met een resolutie van 135x240 pixels en een batterijcapaciteit van 200mAh. (https://shop.m5stack.com/products/m5stickc-plus2-esp32-mini-iot-development-kit)

source: M5-Watch wristband for M5 StickC Plus2 (optional)
nl: M5-Watch polsband voor M5 StickC Plus2 (optioneel)

source: The code for the pictostick is Free/Open Source software made available under the Creative Commons Zero v1.0 Universal License at https://github.com/jsoeterbroek/pictostick Github repository.
nl: De code voor de pictostick is Vrije/Open Source software die beschikbaar wordt gesteld onder de Creative Commons Zero v1.0 Universal-licentie op de https://github.com/jsoeterbroek/pictostick Github-repository.

source: License
nl: Licentie

source: The Pictostick project is licensed under the 'Creative Commons Zero v1.0 Universal' license. The picto icons used are Google Fonts Material Design icons, made available under the Apache License Version 2.0 license.
nl: Het Pictostick-project is gelicentieerd onder de 'Creative Commons Zero v1.0 Universal'-licentie. De gebruikte picto-iconen zijn Google Fonts Material Design-iconen, beschikbaar gesteld onder de Apache License Version 2.0-licentie.

source: How to use the PictoStick
nl: Hoe de PictoStick te gebruiken

source: **Intended Audience** This document is intended for PictoStick everyday users. It also holds relevant information for Caretakers, Health Professionals and Parents of users.
nl: **Doelgroep** Dit document is bedoeld voor dagelijkse gebruikers van de PictoStick. Het bevat ook relevante informatie voor zorgverleners, gezondheidsprofessionals en ouders van gebruikers.

source: This document will show you how to use your PictoStick. The device is pre-configured to show you your activities for the entire week in the correct order. Every activity is displayed on the screen with a picture (a "picto") and a short description.
nl: Dit document laat u zien hoe u uw PictoStick moet gebruiken. Het apparaat is vooraf geconfigureerd om u uw activiteiten voor de hele week in de juiste volgorde te tonen. Elke activiteit wordt op het scherm weergegeven met een afbeelding (een "picto") en een korte beschrijving.

source: The Buttons
nl: De Knoppen

source: The PictoStick has three buttons that you can use, as shown in the image below:
nl: De PictoStick heeft drie knoppen die u kunt gebruiken, zoals weergegeven in de onderstaande afbeelding:

source: Diagram of the PictoStick buttons
nl: Diagram van de PictoStick-knoppen

source: **Button A (Side Button)**: Use this to scroll **up** through your activities. This is also the main power button.
nl: **Knop A (Zijknop)**: Gebruik deze om **omhoog** door uw activiteiten te scrollen. Dit is ook de hoofd-aan/uit-knop.

source: **Button B (Side Button)**: Use this to scroll **down** through your activities.
nl: **Knop B (Zijknop)**: Gebruik deze om **omlaag** door uw activiteiten te scrollen.

source: **Button C (Large M5 Button)**: Press this to mark an activity as **done**.
nl: **Knop C (Grote M5-knop)**: Druk hierop om een activiteit als **klaar** te markeren.

source: Waking Up the Device
nl: Het Apparaat Activeren

source: To save battery, the screen will automatically turn off after a few seconds. This is sleep mode.
nl: Om de batterij te sparen, wordt het scherm na enkele seconden automatisch uitgeschakeld. Dit is de slaapstand.

source: **To wake the device up**: Briefly press **Button A**. The screen will light up, showing your current activity.
nl: **Om het apparaat te activeren**: Druk kort op **Knop A**. Het scherm licht op en toont uw huidige activiteit.

source: The Main Screen
nl: Het Hoofdscherm

source: The screen shows you everything you need to know for your day.
nl: Het scherm toont u alles wat u moet weten voor uw dag.

source: The main screen of the PictoStick
nl: Het hoofdscherm van de PictoStick

source: **Your Name**: At the very top, you will see your name.
nl: **Uw Naam**: Helemaal bovenaan ziet u uw naam.

source: **Day and Time**: Below your name, the current day of the week and the time are displayed.
nl: **Dag en Tijd**: Onder uw naam worden de huidige dag van de week en de tijd weergegeven.

source: **Activity**: The main part of the screen shows your current activity, with a large picto on the left and a description on the right.
nl: **Activiteit**: Het hoofdgedeelte van het scherm toont uw huidige activiteit, met een grote picto links en een beschrijving rechts.

source: **Progress Dots**: The row of circles at the bottom shows your progress for the day. Each circle is one activity. * An **orange** circle means the activity is not yet completed. * A **green** circle means the activity has been marked as done.
nl: **Voortgangsbolletjes**: De rij met cirkels onderaan toont uw voortgang voor de dag. Elke cirkel is één activiteit. * Een **oranje** cirkel betekent dat de activiteit nog niet is voltooid. * Een **groene** cirkel betekent dat de activiteit als voltooid is gemarkeerd.

source: **Battery Level**: The small battery icon in the top-right corner shows how much power is left.
nl: **Batterijniveau**: Het kleine batterijpictogram in de rechterbovenhoek toont hoeveel stroom er nog over is.

source: Navigating Your Day
nl: Navigeren door uw Dag

source: You can look at all of your activities for the current day.
nl: U kunt al uw activiteiten voor de huidige dag bekijken.

source: Press **Button B** to see the **next** activity.
nl: Druk op **Knop B** om de **volgende** activiteit te zien.

source: Press **Button A** to go back to the **previous** activity.
nl: Druk op **Knop A** om terug te gaan naar de **vorige** activiteit.

source: The device automatically shows the correct list of activities for the current day of the week (Monday, Tuesday, etc.).
nl: Het apparaat toont automatisch de juiste lijst met activiteiten voor de huidige dag van de week (maandag, dinsdag, etc.).

source: Marking an Activity as Done
nl: Een Activiteit als Klaar Markeren

source: When you finish an activity, you can mark it as complete.
nl: Wanneer u een activiteit voltooit, kunt u deze als voltooid markeren.

source: Navigate to the activity you have finished.
nl: Navigeer naar de activiteit die u hebt voltooid.

source: Briefly press the large **M5 Button (Button C)**.
nl: Druk kort op de grote **M5-knop (Knop C)**.
