Repository: jsoeterbroek/pictostick
Catalog: pictodevice/docs/locale/*/LC_MESSAGES/docs.po
Languages: nl

source: The progress dot for that activity at the bottom of the screen will turn from **orange** to **green**.
nl: Het voortgangsbolletje voor die activiteit onderaan het scherm verandert van **oranje** in **groen**.

source: If you make a mistake, you can press Button C again to change the dot back to orange.
nl: Als u een fout maakt, kunt u nogmaals op Knop C drukken om het bolletje weer oranje te maken.

source: Powering Off Completely
nl: Volledig Uitschakelen

source: You do not normally need to turn the PictoStick off completely. Sleep mode is usually best for saving power. However, if you need to turn it off entirely:
nl: Normaal gesproken hoeft u de PictoStick niet volledig uit te schakelen. De slaapstand is meestal het beste om stroom te besparen. Als u het echter volledig moet uitschakelen:

source: **To Power Off**: Press and hold **Button A** for about 6 seconds. The screen will go blank.
nl: **Uitschakelen**: Houd **Knop A** ongeveer 6 seconden ingedrukt. Het scherm wordt zwart.

source: **To Power On**: Press and hold **Button A** again for 6 seconds.
nl: **Inschakelen**: Houd **Knop A** nogmaals 6 seconden ingedrukt.

source: When the device is off completely, it cannot show your activities. It's best to let it go to sleep on its own and wake it by pressing Button A when you need it.
nl: Wanneer het apparaat volledig is uitgeschakeld, kan het uw activiteiten niet weergeven. Het is het beste om het vanzelf in de slaapstand te laten gaan en het te activeren door op Knop A te drukken wanneer u het nodig hebt.
